INSERT INTO author (id, first_name, last_name)
VALUES (1, 'Лев', 'Толстой'),
       (2, 'Фёдор', 'Достоевский'),
       (3, 'Александр', 'Пушкин'),
       (4, 'Николай', 'Гоголь');

INSERT INTO genre (id, name)
VALUES (1, 'Роман'),
       (2, 'Сказка'),
       (3, 'Поэма'),
       (4, 'Комедия'),
       (5, 'Повесть');

INSERT INTO book (id, name, author_id, genre_id)
VALUES (1, 'Война и мир', 1, 1),
       (2, 'Анна Каренина', 1, 1),
       (3, 'Преступление и наказание', 2, 1),
       (4, 'Сказка о царе Салтане', 3, 2),
       (5, 'Евгений Онегин', 3, 1),
       (6, 'Капитанская дочка', 3, 1),
       (7, 'Кавказский пленник', 3, 3),
       (8, 'Ревизор', 4, 4),
       (9, 'Женитьба', 4, 4),
       (10, 'Записки сумасшедшего', 4, 5);